benders/force-4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# USB CDC console
CONFIG_ESP_CONSOLE_USB_CDC=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=1

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# FreeRTOS tick rate (1ms ticks)
CONFIG_FREERTOS_HZ=1000
